/*****************************************************************************/
/*                       ЗАГОЛОВОЧНЫЙ ФАЙЛ МОДЕЛИ КСУ                        */
/*                            ВХОДНЫЕ ПАРАМЕТРЫ                              */
/*                                                                           */
/*****************************************************************************/
#ifndef KSU_IN_HXX
#define KSU_IN_HXX

// Структура входных параметров КСУ
struct TKSU_IN
{
    // Количество тиков от диспетчера комплекса [ед]
    unsigned long tick;

    // Вес одного тика [мс]
    unsigned long step;

    // Разрешение запуска основного цикла от диспетчера
    short go;

    /*Ниже необходимо написать свой код - наполнение входной структуры*/
    
    // Компоненты скорости в георграфической С`К [м/с]
    float V_e;
    float V_n;
    float V_h;
    
    // Компоненты угловой скорости в связанной СК [рад/с]
    float w_x;
    float w_y;
    float w_z;
    
    // Курс ЛА [рад]
    float psi;

    // Тангаж ЛА [рад]
    float tet;

    // Крен ЛА [рад]
    float gam;

    // Широта географическая [рад]
    float phi;

    // Долгота географическая [рад]
    float lm;

    // Высота абсолютная [м]
    float H;

    // Положение РУС по тангажу
    float stick_tet;

    // Положение РУС по крену
    float stick_gam;

    // Положение РУС по курсу (педали)
    float stick_psi;

    // Положение РУД
    float TCL;

    /*Конец пользовательского кода*/
};

extern TKSU_IN KSU_in;

#endif