/*****************************************************************************/
/*                       ЗАГОЛОВОЧНЫЙ ФАЙЛ МОДЕЛИ ФПЗ                        */
/*                            ВХОДНЫЕ ПАРАМЕТРЫ                              */
/*                                                                           */
/*****************************************************************************/
#ifndef FPZ_IN_HXX
#define FPZ_IN_HXX

// Структура входных параметров ФПЗ
struct TFPZ_IN
{
    // Количество тиков от диспетчера комплекса [ед]
    unsigned long tick;

    // Вес одного тика [мс]
    unsigned long step;

    // Разрешение запуска основного цикла от диспетчера
    short go;

    /*Ниже необходимо написать свой код - наполнение входной структуры*/

    // Широта географическая [рад]
    float phi;

    // Долгота географическая [рад]
    float lm;

    // Высота полета ЛА [м]
	float H;

    /*Конец пользовательского кода*/
};

extern TFPZ_IN FPZ_in;
#endif