/*****************************************************************************/
/*                       ЗАГОЛОВОЧНЫЙ ФАЙЛ МОДЕЛИ ЛА                         */
/*                           ВЫХОДНЫЕ ПАРАМЕТРЫ                              */
/*                                                                           */
/*****************************************************************************/
#ifndef LA_OUT_HXX
#define LA_OUT_HXX

// Структура выходных параметров ЛА
struct TLA_OUT
{
    // Выходной json "LAstruct"

    // Признак готовности модели (подключение к таймеру)
    // Ключ в json "timerReady"
    short timerReady;

    // Признак проведенной инициализации модели
    // Ключ в json "initReady"
    short initReady;

    /*Ниже необходимо написать свой код - наполнение входной структуры*/

    struct TData
    {
        // Широта географическая [рад]
        // Ключ в json "phi"
        float phi;

        // Долгота географическая [рад]
        // Ключ в json "lm"
        float lm;
        
        // Высота абсолютная [м]
        // Ключ в json "H"
        float H;

        // Курс ЛА [рад]
        // Ключ в json "psi"
        float psi;

        // Тангаж ЛА [рад]
        // Ключ в json "tet"
        float tet;

        // Крен ЛА [рад]
        // Ключ в json "gam"
        float gam;

        /// Скорость ЛА [м/с]
        // Ключ в json "V"
        float V;

        // Компоненты скорости в георграфической СК [м/с]
        // Ключ в json "V_e"
        float V_e;

        // Ключ в json "V_n"
        float V_n;

        // Ключ в json "V_h"
        float V_h;

        // Компоненты ускорения в связанной СК [м/с/с]
        // Ключ в json "a_x"
        float a_x;

        // Ключ в json "a_y"
        float a_y;

        // Ключ в json "a_z"
        float a_z;

        // Компоненты угловой скорости в связанной СК [рад/с]
        // Ключ в json "w_x"
        float w_x;

        // Ключ в json "w_y"
        float w_y;

        // Ключ в json "w_z"
        float w_z;

    } Data;

    /*Конец пользовательского кода*/
};

extern TLA_OUT LA_out;

#endif