/*****************************************************************************/
/*                       ЗАГОЛОВОЧНЫЙ ФАЙЛ МОДЕЛИ ЛА                         */
/*                            ВХОДНЫЕ ПАРАМЕТРЫ                              */
/*                                                                           */
/*****************************************************************************/
#ifndef IUP_IN_HXX
#define IUP_IN_HXX

// Структура входных параметров ФПЗ
struct TIUP_IN
{
    // Количество тиков от диспетчера комплекса [ед]
    unsigned long tick;

    // Вес одного тика [мс]
    unsigned long step;

    // Разрешение запуска основного цикла от диспетчера
    short go;

    /*Ниже необходимо написать свой код - наполнение входной структуры*/

    struct TfromOU
    {
        // Положение РУС по тангажу
        float stick_tet;

        // Положение РУС по крену
        float stick_gam;

        // Положение РУС по курсу (педали)
        float stick_psi;

        // Положение РУД
        float TCL;

    } fromOU;

    struct TfromKSU
    {
        // Угол отклонения руля высоты от КСУ [рад]
        float phi_rv;

        // Угол отклонения руля направления от КСУ [рад]
        float phi_rn;
        
        // Угол отклонения элеронов от КСУ [рад]
        float phi_el;

        // Угол отклонения насоса-регулятора автомата тяги от КСУ [рад]
        float phi_AT;

    } fromKSU;

    struct TfromLA
    {
        // Широта географическая [рад]
        float phi;

        // Долгота географическая [рад]
        float lm;
        
        // Высота абсолютная [м]
        float H;

        // Курс ЛА [рад]
        float psi;

        // Тангаж ЛА [рад]
        float tet;

        // Крен ЛА [рад]
        float gam;

        /// Скорость ЛА [м/с]
        float V;

        // Компоненты скорости в георграфической СК [м/с]
        float V_e;
        float V_n;
        float V_h;

        // Компоненты ускорения в связанной СК [м/с/с]
        float a_x;
        float a_y;
        float a_z;

        // Компоненты угловой скорости в связанной СК [рад/с]
        float w_x;
        float w_y;
        float w_z;

    } fromLA;

    struct TfromFPZ
    {
        // Радиус Земли [м]
        float R;

        // Ускорение свободного падения [м/с2]
        float g;

        // Высота рельефа [м]
        float H_r;

        // Скорость ветра [м/с]
        float W;

        // Курс ветра [м/с]
        float psi_W;

        // Температура воздуха на высоте
		float T_atmo;

		// Давление воздуха на высоте H и широте phi [Па]
		float P_atmo;

		// Плотность воздуха на высоте H и широте phi [кг/м^3]
		float rho_atmo;
    } fromFPZ;

    struct TfromINS
    {
        // Широта географическая [рад]
        float phi;

        // Долгота географическая [рад]
        float lm;

        // Высота абсолютная [м]
        float H;

        // Курс ЛА [рад]
        float psi;

        // Тангаж ЛА [рад]
        float tet;

        // Крен ЛА [рад]
        float gam;
        
        // Компоненты скорости в георграфической СК [м/с]
        float V_e;
        float V_n;
        float V_h;

        // Компоненты ускорения в связанной СК [м/с/с]
        float a_x;
        float a_y;
        float a_z;

        // Компоненты угловой скорости в связанной СК [рад/с]
        float w_x;
        float w_y;
        float w_z;

        

    } fromINS;

    struct TfromSVS
    {
        // Скорость ЛА [м/с]
        float V;
        
        // Высота ЛА [м]
        float H;

    } fromSVS;
    
    /*Конец пользовательского кода*/
};

extern TIUP_IN IUP_in;

#endif