/*****************************************************************************/
/*                       ЗАГОЛОВОЧНЫЙ ФАЙЛ МОДЕЛИ ЛА                         */
/*                           ВЫХОДНЫЕ ПАРАМЕТРЫ                              */
/*                                                                           */
/*****************************************************************************/
#ifndef IUP_OUT_HXX
#define IUP_OUT_HXX

// Структура выходных параметров ЛА
struct TIUP_OUT
{
    // Выходной json "IUPstruct"

    // Признак готовности модели (подключение к таймеру)
    // Ключ в json "timerReady"
    short timerReady;

    // Признак проведенной инициализации модели
    // Ключ в json "initReady"
    short initReady;

    /*Ниже необходимо написать свой код - наполнение входной структуры*/


    /*Конец пользовательского кода*/
};

extern TIUP_OUT IUP_out;

#endif