
#pragma once

#ifndef	USO_TAK_NET_IOTYPES__HH
#define USO_TAK_NET_IOTYPES__HH

#include "netTypes_spnm.h"
#include "model_wago_header_udp.h"

#define USO_TAK_SERVER		"127.0.0.1"		//"192.168.1.21"
#define USO_TAK_IN_PORT		6011
#define USO_TAK_OUT_PORT	6021

#pragma pack(push, 1)


#define TUsoTakNetIn		TFD_WAGO_Inputs			// Входные данные Кабины : УСО-WAGO <== БРЭО-МСКБО :
#define TUsoTakNetOut		TFD_WAGO_Outputs		// Выходные данные Кабины : УСО-WAGO ==> БРЭО-МСКБО (ММ_ЛА и в БРЭО) :


union TUSO_WAGO_Out_PUPKV		// структура слова состояния Пульта ПКВ [код]
{
	DWORD	w32;								// 16..01 - слово WORD целиком
	struct{
		// 1-й (верхний) ряд кнопок:
		DWORD	AP			:  1;		//   01   - (W1-5-4)/(W1-17-5)  - кнопка/лампа "АП"
		DWORD	Hbar		:  1;		//   02   - (W1-5-8)/(W1-17-9)  - кнопка/лампа "Hбар"
		DWORD	Vpr			:  1;		//   03   - (W1-6-4)/(W1-17-13) - кнопка/лампа "Vпр"
		DWORD	UglSk		:  1;		//   04   - (W1-6-8)/(W1-18-1)  - кнопка/лампа "УглСкор"
		DWORD	Ugol		:  1;		//   05   - (W1-7-4)/(W1-18-5)  - кнопка/лампа "Угол"
		// 2-й (средний) ряд кнопок:
		DWORD	MalSk		:  1;		//   06   - (W1-5-5)/(W1-17-6)  - кнопка/лампа "МалСкор"
		DWORD	Pos			:  1;		//   07   - (W1-6-1)/(W1-17-10) - кнопка/лампа "Посад"
		DWORD	Marsh		:  1;		//   08   - (W1-6-5)/(W1-17-14) - кнопка/лампа "Маршр"
		DWORD	Zahod		:  1;		//   09   - (W1-7-1)/(W1-18-2)  - кнопка/лампа "Заход"
		DWORD	Parir		:  1;		//   10   - (W1-7-5)/(W1-18-6)  - кнопка/лампа "Парир"
		// 3-й (средний) ряд кнопок:
		DWORD	AvtUpr	:  1;		//   11   - (W1-5-6)/(W1-17-7)  - кнопка/лампа "АвтУпр"
		DWORD	DirUpr	:  1;		//   12   - (W1-6-2)/(W1-17-11) - кнопка/лампа "ДирУпр"
		DWORD	AvtTrim	:  1;		//   13   - (W1-6-6)/(W1-17-15) - кнопка/лампа "АвтТрим"
		DWORD	MVP			:  1;		//   14   - (W1-7-2)/(W1-18-3)  - кнопка/лампа "МВП"
		DWORD	Hrv			:  1;		//   15   - (W1-?-?)/(W1-xx-x)  - кнопка/лампа "Hрв"
		// 4-й (нижний) ряд кнопок:
		DWORD	Horiz		:  1;		//   16   - (W1-5-7)/(W1-17-8)  - кнопка/лампа "Гориз"
		DWORD	Visen		:  1;		//   17   - (W1-6-3)/(W1-17-12) - кнопка/лампа "Висен"
		DWORD	Dovor		:  1;		//   18   - (W1-6-7)/(W1-17-16) - кнопка/лампа "Довор"
		DWORD	PG			:  1;		//   19   - (W1-7-3)/(W1-18-5)  - кнопка/лампа "ПГ"
		DWORD	res3220	: 13;		// 20..32 - резерв
	};
};


union TUSO_WAGO_Out_ROSH1			// структура слова состояния "кнопки на РОШ Летчика" [код]
{
	WORD	w32;									// 32..01 - слово DWORD целиком
	struct{
		WORD	UV					:  1;		//   01   - (W1-10-08) - кнопка "УВ" (Увод) (под колпачком)
		WORD	AvS					:  1;		//   02   - (W1-08-03) - кнопка "Аварийный сброс подвесок" (под колпачком)
		WORD	CU					:  1;		//   03   - (W1-11-01) - кнопка "ЦУ"
		WORD	dovorot			:  1;		//   04   - (W1-xx-xx) - кнопка "Доворот"
		WORD	sbrosZad		:  1;		//   05   - (W1-08-04) - кнопка "Сброс задачи"
		WORD	privjaz			:  1;		//   06   - (W1-08-01) - 2-поз. гашетка "Привязка" ( положение : 0-1: не откинута / нажата )
		WORD	sw2_FB			:  1;		//   07   - (W1-xx-xx) - 2-поз. переключатель "Ящик с зарядом Фугасным(0-влево) / Бронебойным(1-вправо)"
		WORD	sw2_TempBM	:  1;		//   08   - (W1-xx-xx) - 2-поз. переключатель "Темп Малый(0-вниз) / Большой(1-вверх)"
	//TSW3		sw2_StOch;		// 3-поз. переключатель "СТ/ОЧ (влево-нейтр-вправо): СК1(влево) / СК2(вправо)"
	//bool		oprisk;				// кнопка "Опрыск"
	//TXY			xyFara;				// 2-координатный манипулятор "Управление фарой"
		WORD	frik				:  1;		//   09   - (W1-xx-xx) - гашетка "Фрикцион"

		DWORD	res1610			:  7;		// 10..16 - резерв
		//
	};//data;
};


// сокет УСО-WAGO ==> БРЭО-МСКБО :
struct TNet_UsoTak2Rt{
	TNET_U16			idpack;		// [2] идентификатор пакета == 0x0041
	TNET_U16			szbuf;		// [2] размер буфера данных пакета [байт]
	TNET_U32			step;			// [4] шаг счета клиента
	TUsoTakNetOut	data;
};

// сокет БРЭО-МСКБО ==> УСО-WAGO :
struct TNet_Rt2UsoTak{
	TNET_U16			idpack;		// [2] идентификатор пакета == 0x0042
	TNET_U16			szbuf;		// [2] размер буфера данных пакета [байт]
	TNET_U32			step;			// [4] шаг счета сервера
	TUsoTakNetIn	data;
};


#pragma pack(pop)


#endif	//USO_TAK_NET_IOTYPES__HH
