/*****************************************************************************/
/*                      ЗАГОЛОВОЧНЫЙ ФАЙЛ МОДЕЛИ ИНС                         */
/*                            ВХОДНЫЕ ПАРАМЕТРЫ                              */
/*                                                                           */
/*****************************************************************************/
#ifndef INS_IN_HXX
#define INS_IN_HXX

// Структура входных параметров ИНС
struct TINS_IN
{
    // Количество тиков от диспетчера комплекса [ед]
    unsigned long tick;

    // Вес одного тика [мс]
    unsigned long step;

    // Разрешение запуска основного цикла от диспетчера
    short go;

    /*Ниже необходимо написать свой код - наполнение входной структуры*/

    // Широта географическая [рад]
    float phi;

    // Долгота географическая [рад]
    float lm;

    // Высота абсолютная [м]
    float H;

    // Курс ЛА [рад]
    float psi;

    // Тангаж ЛА [рад]
    float tet;

    // Крен ЛА [рад]
    float gam;

    // Скорость ЛА [м/с]
    float V;

    // Компоненты скорости в георграфической СК [м/с]
    float V_e;
    float V_n;
    float V_h;

    // Компоненты ускорения в связанной СК [м/с/с]
    float a_x;
    float a_y;
    float a_z;

    // Компоненты угловой скорости в связанной СК [рад/с]
    float w_x;
    float w_y;
    float w_z;

    /*Конец пользовательского кода*/
};

extern TINS_IN INS_in;


#endif